package main

/*
 在go中，则是任何一个package中，都可以有唯一一个带有main方法的go文件

 import引入包有三种方式：

*/

import (
	"fmt"
)

//全局变量声明
var a int = 10

func main() {

	//局部变量声明方式
	b := 33                  //局部变量声明
	var demoInt32 int32 = 98 //局部多变量声明
	var (
		v1 int
		v2 string
	) //局部多变量var声明

	/**********************************************************************************************************/

	//字符串打印
	//可以配合使用 Println()和 Printf()来打印各种自己感兴趣的信息
	fmt.Println("!... Hello World ...!")
	println(demoInt32, a, b)
	//Printf()
	fmt.Printf("字符串打印结果：%d \n", b)

	/**********************************************************************************************************/

	//局部变量赋值
	v1 = 12
	v2 = "hhhshshs"
	fmt.Println(v1, v2)

}
